performanceTests/environment/jmeterVM/jmeter/testScenarios/2_test_scenario_5k_rps_stndDefined.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="test_scenario_2_10k_rps" enabled="true">
      <stringProp name="TestPlan.comments">5k request / 1s</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">startnextloop</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">5000</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">
                {&#xd;
                  &quot;event&quot;: {&#xd;
                    &quot;commonEventHeader&quot;: {&#xd;
                      &quot;version&quot;: &quot;4.1&quot;,&#xd;
                      &quot;vesEventListenerVersion&quot;: &quot;7.2&quot;,&#xd;
                      &quot;domain&quot;: &quot;stndDefined&quot;,&#xd;
                      &quot;eventId&quot;: &quot;stndDefined-gNB_Nokia000001&quot;,&#xd;
                      &quot;eventName&quot;: &quot;stndDefined-gNB-Nokia-PowerLost&quot;,&#xd;
                      &quot;stndDefinedNamespace&quot;: &quot;3GPP-FaultSupervision&quot;,&#xd;
                      &quot;startEpochMicrosec&quot;: 1413378172000000,&#xd;
                      &quot;lastEpochMicrosec&quot;: 1413378172000000,&#xd;
                      &quot;reportingEntityName&quot;: &quot;ibcx0001vm002oam001&quot;,&#xd;
                      &quot;sourceName&quot;: &quot;scfx0001vm002cap001&quot;,&#xd;
                      &quot;sequence&quot;: 1,&#xd;
                      &quot;priority&quot;: &quot;High&quot;&#xd;
                    },&#xd;
                    &quot;stndDefinedFields&quot;: {&#xd;
                      &quot;schemaReference&quot;: &quot;https://forge.3gpp.org/rep/sa5/data-models/tree/SA88-Rel16/OpenAPI/faultMnS.yaml#components/schemas/NotifyNewAlarm&quot;,&#xd;
                      &quot;data&quot;: {&#xd;
                        &quot;href&quot;: 1,&#xd;
                        &quot;uri&quot;: &quot;1&quot;,&#xd;
                        &quot;notificationId&quot;: 1,&#xd;
                        &quot;notificationType&quot;: &quot;notifyNewAlarm&quot;,&#xd;
                        &quot;eventTime&quot;: &quot;xyz&quot;,&#xd;
                        &quot;systemDN&quot;: &quot;xyz&quot;,&#xd;
                        &quot;probableCause&quot;: 1,&#xd;
                        &quot;perceivedSeverity&quot;: &quot;INDETERMINATE&quot;,&#xd;
                        &quot;rootCauseIndicator&quot;: false,&#xd;
                        &quot;specificProblem&quot;: &quot;xyz&quot;,&#xd;
                        &quot;correlatedNotifications&quot;: [],&#xd;
                        &quot;backedUpStatus&quot;: true,&#xd;
                        &quot;backUpObject&quot;: &quot;xyz&quot;,&#xd;
                        &quot;trendIndication&quot;: &quot;MORE_SEVERE&quot;,&#xd;
                        &quot;thresholdInfo&quot;: {&#xd;
                          &quot;observedMeasurement&quot;: &quot;new&quot;,&#xd;
                          &quot;observedValue&quot;: 123&#xd;
                        },&#xd;
                        &quot;stateChangeDefinition&quot;: {&#xd;
                        },&#xd;
                        &quot;monitoredAttributes&quot;: {&#xd;
                          &quot;newAtt&quot;: &quot;new&quot;&#xd;
                        },&#xd;
                        &quot;proposedRepairActions&quot;: &quot;xyz&quot;,&#xd;
                        &quot;additionalText&quot;: &quot;xyz&quot;,&#xd;
                        &quot;additionalInformation&quot;: {&#xd;
                          &quot;addInfo&quot;: &quot;new&quot;&#xd;
                        },&#xd;
                        &quot;alarmId&quot;: &quot;1&quot;,&#xd;
                        &quot;alarmType&quot;: &quot;COMMUNICATIONS_ALARM&quot;&#xd;
                      },&#xd;
                      &quot;stndDefinedFieldsVersion&quot;: &quot;1.0&quot;&#xd;
                    }&#xd;
                  }&#xd;
</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">WORKER_IP</stringProp>
          <stringProp name="HTTPSampler.port">30417</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/eventListener/v7</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
        <AuthManager guiclass="AuthPanel" testclass="AuthManager" testname="HTTP Authorization Manager" enabled="true">
          <collectionProp name="AuthManager.auth_list">
            <elementProp name="" elementType="Authorization">
              <stringProp name="Authorization.url">https://WORKER_IP:30417/eventListener/v7</stringProp>
              <stringProp name="Authorization.username">sample1</stringProp>
              <stringProp name="Authorization.password">sample1</stringProp>
            </elementProp>
          </collectionProp>
          <boolProp name="AuthManager.controlledByThreadGroup">false</boolProp>
        </AuthManager>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <BackendListener guiclass="BackendListenerGui" testclass="BackendListener" testname="Backend Listener" enabled="true">
          <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="influxdbMetricsSender" elementType="Argument">
                <stringProp name="Argument.name">influxdbMetricsSender</stringProp>
                <stringProp name="Argument.value">org.apache.jmeter.visualizers.backend.influxdb.HttpMetricsSender</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="influxdbUrl" elementType="Argument">
                <stringProp name="Argument.name">influxdbUrl</stringProp>
                <stringProp name="Argument.value">http://WORKER_IP:30002/write?db=jmeter</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="application" elementType="Argument">
                <stringProp name="Argument.name">application</stringProp>
                <stringProp name="Argument.value">ves</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="measurement" elementType="Argument">
                <stringProp name="Argument.name">measurement</stringProp>
                <stringProp name="Argument.value">jmeter</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="summaryOnly" elementType="Argument">
                <stringProp name="Argument.name">summaryOnly</stringProp>
                <stringProp name="Argument.value">false</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="samplersRegex" elementType="Argument">
                <stringProp name="Argument.name">samplersRegex</stringProp>
                <stringProp name="Argument.value">.*</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="percentiles" elementType="Argument">
                <stringProp name="Argument.name">percentiles</stringProp>
                <stringProp name="Argument.value">90;95;99</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="testTitle" elementType="Argument">
                <stringProp name="Argument.name">testTitle</stringProp>
                <stringProp name="Argument.value">Test name</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="eventTags" elementType="Argument">
                <stringProp name="Argument.name">eventTags</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="classname">org.apache.jmeter.visualizers.backend.influxdb.InfluxdbBackendListenerClient</stringProp>
        </BackendListener>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>